app/Listeners/UpdateStatusSantri.php

    public function handle(PembayaranUpdated $event)
{
    $pembayaran = $event->pembayaran;

    // Ambil bulan saat ini
    $bulanIndonesia = [
        1 => 'januari', 'februari', 'maret', 'april', 'mei', 'juni',
        'juli', 'agustus', 'september', 'oktober', 'november', 'desember'
    ];
    $bulanSaatIni = $bulanIndonesia[date('n')];

    // Ambil santri terkait
    $santri = Santri::find($pembayaran->santri_id);

    if ($santri) {
        // Cek pembayaran lain untuk santri
        $pembayaranLain = Pembayaran::where('santri_id', $santri->id)
            ->where('kelas', $santri->kelas)
            ->where('bulan', $bulanSaatIni)
            ->first();
---
select * from `santri` where `santri`.`id` = '4' limit 1
select * from `pembayaran` where `santri_id` = '4' and `kelas` = '12' and `bulan` = 'juli' limit 1