app/Http/Controllers/HomeController.php

    public function index()
    {
        $pembayaran = Pembayaran::get();
        $santri   = Santri::get();
        $kasmasuk = KasMasuk::get();
        $kaskeluar = KasKeluar::get();
        // Menghitung total nominal dari kasmasuk
        $totalKasMasuk = KasMasuk::sum('nominal');
        // Menghitung total nominal dari kaskeluar
        $totalKasKeluar = KasKeluar::sum('nominal');

        $datas = Pembayaran::where('status', 'belum setuju')->get();
---
select * from `pembayaran`
select * from `santri`
select * from `kasmasuk`
select * from `kaskeluar`
select sum(`nominal`) as aggregate from `kasmasuk`
select sum(`nominal`) as aggregate from `kaskeluar`
select * from `pembayaran` where `status` = 'belum setuju'

    public function getKasComparison()
    {
        // Ambil data kas masuk
        $kasMasuk = DB::table('kasmasuk')
            ->select(DB::raw('SUM(nominal) as total_nominal'))
            ->pluck('total_nominal')
            ->first();

        // Ambil data kas keluar
        $kasKeluar = DB::table('kaskeluar')
            ->select(DB::raw('SUM(nominal) as total_nominal'))
            ->pluck('total_nominal')
            ->first();
---
select SUM(nominal) as total_nominal from `kasmasuk`
select SUM(nominal) as total_nominal from `kaskeluar`

    public function getNominalKeluarByCategory()
    {
        $data = DB::table('kaskeluar')
            ->select('kategori', DB::raw('SUM(nominal) as total_nominal'))
            ->groupBy('kategori')
            ->get();
---
select `kategori`, SUM(nominal) as total_nominal from `kaskeluar` group by `kategori`

    public function getNominalMasukByCategory()
    {
        $data = DB::table('kasmasuk')
            ->select('kategori', DB::raw('SUM(nominal) as total_nominal'))
            ->groupBy('kategori')
            ->get();
---
select `kategori`, SUM(nominal) as total_nominal from `kasmasuk` group by `kategori`