app/Http/Controllers/KasMasukController.php

select * from `kasmasuk`
---
    public function index(Request $request)
    {
        $startMonth = $request->input('start_month');
        $endMonth = $request->input('end_month');

        $query = KasMasuk::query();

        if ($startMonth && $endMonth) {
            // Menggunakan Carbon untuk memformat tanggal
            $startDate = Carbon::createFromFormat('Y-m', $startMonth)->startOfMonth();
            $endDate = Carbon::createFromFormat('Y-m', $endMonth)->endOfMonth();

            $query->whereBetween('tgl', [$startDate, $endDate]);
        }

        $datas = $query->get();