app/Http/Controllers/LaporanController.php

    public function showLaporanPembayaranForm()
    {
        // Ambil data santri dari database
        $santris = Santri::all(); // Ganti 'Santri' dengan nama model santri Anda
---
select * from `santri`

public function pembayaranPdf(Request $request)
{
    $q = Pembayaran::query();

    // Filter berdasarkan status
    if ($request->has('status') && $request->status != '') {
        if ($request->status == 'belum setuju') {
            $q->where('status', 'belum setuju');
        } else {
            $q->where('status', 'setuju');
        }
    }

    // Filter berdasarkan santri_id
    if ($request->has('santri_id') && $request->santri_id != '') {
        $q->where('santri_id', $request->santri_id);
    }

    // Filter berdasarkan kelas
    if ($request->has('kelas') && $request->kelas != '') {
        $q->where('kelas', $request->kelas);
    }

    $datas = $q->get();
---
select * from `pembayaran` where `status` = 'setuju' and `santri_id` = '2' and `kelas` = '12'

public function kasMasukPdf(Request $request)
{
    $q = KasMasuk::query();

    // Filter berdasarkan kategori
    if ($request->get('kategori')) {
        $q->where('kategori', $request->get('kategori'));
---
select * from `kasmasuk` where `kategori` = 'pembayaran'