app/Http/Controllers/PembayaranController.php

    public function status(Request $request, $id)
    {
        $pembayaran = Pembayaran::find($id);

        $pembayaran->update([
            'status' => 'setuju'
        ]);

        //tagihan berkurang 1 bulan
        $pembayaran->santri->where('id', $pembayaran->santri->id)
            ->update([
                'bulan_tagihan' => ($pembayaran->santri->bulan_tagihan - 1),
            ]);
---
update `pembayaran` set `status` = 'setuju', `updated_at` = '2024-07-22 17:02:46' where `id` = '52'
select * from `santri` where `santri`.`id` = '4' limit 1