app/Http/Controllers/PembayaranController.php

select * from `pembayaran` where `bulan` = 'februari' and year(`created_at`) = '2024'
---
    public function index(Request $request)
    {
        $filterMonth = $request->input('filter_month');
        $filterYear = $request->input('filter_year');

        $query = Pembayaran::query();

        if ($filterMonth) {
            $query->where('bulan', $filterMonth);
        }

        if ($filterYear) {
            $query->whereYear('created_at', $filterYear);
        }

        $datas = $query->get();

select * from `pembayaran` where `status` = 'belum setuju'
---
    public function indexBelum()
    {
        $datas = Pembayaran::where('status', 'belum setuju')->get();

select * from `pembayaran` where `status` = 'setuju'
---
    public function indexTelah()
    {
        $datas = Pembayaran::where('status', 'setuju')->get();

select * from `pembayaran` order by `id` desc
select * from `santri`
---
    public function create(Request $request, $santri_id = null)
    {
        // Logika pembuatan kode pembayaran
        $getRow = Pembayaran::orderBy('id', 'DESC')->get();
        $rowCount = $getRow->count();
        $lastId = $getRow->first();
        $kode = "P00001";

        if ($rowCount > 0) {
            if ($lastId->id < 9) {
                $kode = "P0000" . ($lastId->id + 1);
            } else if ($lastId->id < 99) {
                $kode = "P000" . ($lastId->id + 1);
            } else if ($lastId->id < 999) {
                $kode = "P00" . ($lastId->id + 1);
            } else if ($lastId->id < 9999) {
                $kode = "P0" . ($lastId->id + 1);
            } else {
                $kode = "P" . ($lastId->id + 1);
            }
        }

        // Ambil query string 'santri_id' jika ada
        $santri_id = $request->query('santri_id', $santri_id);
        $santri = null;

        if ($santri_id) {
            $santri = Santri::find($santri_id);
        }

        $santris = Santri::get();

insert into `pembayaran` (`kode_pembayaran`, `santri_id`, `bukti`, `bulan`, `kelas`, `nominal`, `status`, `updated_at`, `created_at`) values ('P00029', '4', '68627-2024-07-22-16-06-35.jpg', 'juni', '10', '500000', 'belum setuju', '2024-07-22 16:06:35', '2024-07-22 16:06:35')
---
    public function store(Request $request)
    {
        $this->validate($request, [
            'kode_pembayaran' => 'required|string|max:255',
            'santri_id' => 'required',
        ]);

        if ($request->file('bukti')) {
            $file = $request->file('bukti');
            $dt = Carbon::now();
            $acak = $file->getClientOriginalExtension();
            $fileName = rand(11111, 99999) . '-' . $dt->format('Y-m-d-H-i-s') . '.' . $acak;
            $request->file('bukti')->move("images/pembayaran", $fileName);
            $bukti = $fileName;
        } else {
            $bukti = NULL;
        }

        $santri = Santri::find($request->get('santri_id'));

        $pembayaran = Pembayaran::create([
            'kode_pembayaran' => $request->get('kode_pembayaran'),
            'santri_id' => $request->get('santri_id'),
            'bukti' => $bukti,
            'bulan' => $request->get('bulan'),
            'kelas' => $request->get('kelas'),
            'nominal' => $request->get('nominal'),
            'status' => $request->get('status')
        ]);

insert into `pembayaran` (`kode_pembayaran`, `santri_id`, `bukti`, `bulan`, `kelas`, `nominal`, `status`, `updated_at`, `created_at`) values ('P00049', '4', '64606-2024-07-22-16-55-30.jpg', 'februari', '12', '500000', 'belum setuju', '2024-07-22 16:55:30', '2024-07-22 16:55:30')
---
    public function storeWali(Request $request)
    {
        \Log::info($request->all());
        $this->validate($request, [
            'kode_pembayaran' => 'required|string|max:255',
            'santri_id' => 'required',
        ]);

        if ($request->file('bukti')) {
            $file = $request->file('bukti');
            $dt = Carbon::now();
            $acak = $file->getClientOriginalExtension();
            $fileName = rand(11111, 99999) . '-' . $dt->format('Y-m-d-H-i-s') . '.' . $acak;
            $file->move("images/pembayaran", $fileName);
            $bukti = $fileName;
        } else {
            $bukti = NULL;
        }

        $pembayaran = Pembayaran::create([
            'kode_pembayaran' => $request->get('kode_pembayaran'),
            'santri_id' => $request->get('santri_id'),
            'bukti' => $bukti,
            'bulan' => $request->get('bulan'),
            'kelas' => $request->get('kelas'),
            'nominal' => $request->get('nominal'),
            'status' => $request->get('status'),
        ]);

select * from `pembayaran` where `pembayaran`.`id` = '1' limit 1
---
    public function show($id)
    {
        $data = Pembayaran::findOrFail($id);

select * from `pembayaran` where `kode_pembayaran` = 'P00025' limit 1
select * from `santri` where `santri`.`id` in ('4')
---
    public function getDetails(Request $request)
    {
        $kodePembayaran = $request->kode_pembayaran;
        $pembayaran = Pembayaran::with('santri')->where('kode_pembayaran', $kodePembayaran)->first();

select * from `pembayaran` where `pembayaran`.`id` = '19' limit 1
select * from `santri`
---
    public function edit($id)
    {
        $data = Pembayaran::findOrFail($id);

        // if((Auth::user()->level == 'user') && (Auth::user()->customer->id != $data->customer_id)) {
        //         Alert::info('Oopss..', 'Anda dilarang masuk ke area ini.');
        //         return redirect()->to('/');
        // }
        $santris = Santri::get();

select * from `pembayaran` where `pembayaran`.`id` = '52' limit 1
---
    public function update(Request $request, $id)
    {
        // Ambil data pembayaran berdasarkan $id
        $pembayaran = Pembayaran::findOrFail($id);

update `santri` set `bulan_tagihan` = '6', `updated_at` = '2024-07-22 17:02:46' where `id` = '4'
insert into `kasmasuk` (`tgl`, `kategori`, `keterangan`, `nominal`, `updated_at`, `created_at`) values ('2024-07-22 17:02:46', 'pembayaran', 'P00052 | Claudia Febriani | 12 | mei', '500000', '2024-07-22 17:02:46', '2024-07-22 17:02:46')
---

            // Jika status berubah dari "belum" ke "sudah"
            if ($oldStatus === 'belum setuju' && $request->input('status') === 'setuju') {
                $santri->update([
                    'bulan_tagihan' => $santri->bulan_tagihan - 1,
                ]);

                // Tambahkan data ke tabel kasmasuk
                KasMasuk::create([
                    'tgl' => now(),
                    'kategori' => 'pembayaran',
                    'keterangan' => $pembayaran->kode_pembayaran . ' | ' . $santri->nama . ' | ' . $pembayaran->kelas . ' | ' . $pembayaran->bulan,
                    'nominal' => $pembayaran->nominal
                ]);