app/Http/Controllers/SantriController.php

select * from `santri`
---
    public function index()
    {
        $datas = Santri::get();

select * from `santri` where `kelas` = '10'
---
    public function index10()
    {
        $datas = Santri::where('kelas', '10')->get();

select * from `santri` where `kelas` = '11'
---
    public function index11()
    {
        $datas = Santri::where('kelas', '11')->get();

select * from `santri` where `santri`.`id` = '4' limit 1
select * from `pembayaran` where `santri_id` = '4'
select distinct `kelas` from `pembayaran`
---
    public function show($id)
    {
        $data = Santri::findOrFail($id);

        // Ambil semua pembayaran untuk santri
        $pembayarans = Pembayaran::where('santri_id', $data->id)->get();

        // Ambil semua kelas untuk opsi filter dan urutkan
        $kelasOptions = Pembayaran::distinct()->pluck('kelas')->sort()->values();

select * from `santri` where `santri`.`id` = '2' limit 1
---
    public function edit($id)
    {
        $data = Santri::findOrFail($id);

select * from `santri` where `santri`.`id` = '4' limit 1
---
    public function update(Request $request, $id)
    {
        $santri_data = Santri::findOrFail($id);