app/Http/Controllers/UserController.php

    public function edit($id)
    {
        if((Auth::user()->level == 'user') && (Auth::user()->id != $id)) {
            Alert::success('Berhasil', 'Data berhasil diupdate!');
            return redirect()->route('user.edit', $id);
        }

        $data = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '2' limit 1

    public function update(Request $request, $id)
    {
        $user_data = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '2' limit 1