app/Http/Controllers/WaliController.php

select * from `santri`
---
    public function index()
    {
        $datas = Santri::get();

select * from `santri` where `nik` = '12345678' limit 1
---
    public function login(Request $request)
    {
        $request->validate([
            'nik' => 'required',
            'password' => 'required',
        ]);

        $santri = Santri::where('nik', $request->nik)->first();

select * from `santri` where `nik` = '12345678' limit 1
select * from `pembayaran` order by `id` desc
---
    public function dataBayar(Request $request)
    {
        // Mengambil NIK dari session
        $nik = $request->session()->get('nik');

        // Temukan santri berdasarkan NIK
        $santri = Santri::where('nik', $nik)->first();

        if (!$santri) {
            Alert::error('Error', 'Santri tidak ditemukan.');
            return redirect('/loginWali');
        }

        // Logika pembuatan kode pembayaran
        $getRow = Pembayaran::orderBy('id', 'DESC')->get();

select * from `pembayaran` where `santri_id` = '4'
select distinct `kelas` from `pembayaran`
---
        }

        // Ambil semua pembayaran untuk santri
        $pembayarans = Pembayaran::where('santri_id', $santri->id)->get();

        // Ambil semua kelas untuk opsi filter dan urutkan
        $kelasOptions = Pembayaran::distinct()->pluck('kelas')->sort()->values();